api/lib/tasks/articles.rake

  task update_articles: :environment do
    require 'json'

    last_article = Article.last
    request = RestClient.get "https://api.spaceflightnewsapi.net/v3/articles?_limit=25", {content_type: :json, accept: :json}
    articles = JSON.parse(request)
    art = []
    articles.map do |article|
      if article["publishedAt"] > last_article.publishedAt
        a = {
          id: nil,
          imageUrl: article["imageUrl"],
          newsSite: article["newsSite"],
          publishedAt: article["publishedAt"],
          summary: article["summary"],
          title: article["title"],
          updatedAt: article["updatedAt"],
        }
        art.push(a)
      end
    end

    Article.create!(art)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "imageUrl", "newsSite", "publishedAt", "summary", "updatedAt", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)