api/app/controllers/api/v1/articles_controller.rb

SELECT COUNT(*) FROM "articles" WHERE (title like '%CANADA%')
SELECT "articles".* FROM "articles" WHERE (title like '%CANADA%') ORDER BY articles.publishedAt desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" ORDER BY articles.publishedAt desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    sort_dir = index_params[:sort_dir] || 'asc'
    page = index_params[:page] || 1
    limit = index_params[:limit] || 10
    if index_params[:search].present?
    @pagy, @articles = pagy(Article.all.where("title like ?", "%#{index_params[:search]}%").order("articles.publishedAt #{sort_dir}"), page: page.to_i, items: limit.to_i)
    render json: { data: @articles,
                  total: @pagy.count }
    else
      @pagy, @articles = pagy(Article.all.order("articles.publishedAt #{sort_dir}"), page: page.to_i, items: limit.to_i)

INSERT INTO "articles" ("title", "imageUrl", "newsSite", "publishedAt", "summary", "updatedAt", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "summary" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["summary", "The European Space Agency has again delayed the first flight of Europe’s Ariane 6 launch vehicle, this time to late 2023"], ["updated_at", "2022-10-19 20:54:08.367753"], ["id", 25]]
---
  def update
    if @article.update(article_params)